Revit 2027 API
BuiltInFailures.DocumentFailures Class
 Failures about DocumentFailures.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DocumentFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class DocumentFailures
Public NotInheritable Class DocumentFailures
public ref class DocumentFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DocumentFailures = class end
The BuiltInFailures.DocumentFailures type exposes the following members.
Properties
Name | Description
ApiDelayedUpdateFailed |  Delayed Updating Failed. Please contact the 3rd Party Application vendor.
CannotAutoUpdate |  Coordination Monitor can't update element
CannotLoadLink |  Can't load Linked File [Name] due to errors. Open it separately to investigate the problem.
DUExcessiveRegeneration |  Third party updater '[Name]' has caused an infinite loop and its action had to be canceled.
DUMisbehavingUpdater |  Third party updater '[Name]' has experienced a problem and its action had to be canceled.
Top
See Also
Reference
Autodesk.Revit.DB Namespace